
var furniture = ['桌子', '椅子', '衣柜', '茶几', '沙发', '抽屉柜', '实木门', '浴缸'];
var electrical = ['洗衣机', '冰箱', '电视', '空调', '吹风机', '电饭煲', '吸油烟机', '吸尘器'];
var toys = ['儿童羽毛球拍', '毛绒玩偶', '玩具小熊', '拼图', '积木', '玩具车', '芭比娃娃', '玩具水枪'];
var vegetables = ['苹果', '香蕉', '草莓', '葡萄', '毛豆', '香菇', '苦瓜', '胡萝卜'];
var clothings = ['毛衣', '衬衣', '外套', '羽绒服', '西服', '马夹', '短裤', '裙子'];
var objType = [furniture, electrical, toys, vegetables, clothings];


var furnitureDsc = [
   '网红甜品店咖啡厅铁艺休闲桌椅现代小酒馆饭店方形实木餐桌椅组合',
   '电脑椅真皮老板椅总裁椅子办公椅可躺皮椅家用人体工学椅电竞椅',
   '简易衣柜布艺单人钢架衣橱出租房宿舍寝室家用衣服收纳架储物架 双排咖啡色',
   '简约茶几客厅家用边桌轻奢小户型茶几电视柜组合 60鱼肚白岩板+70鱼肚白岩板',
   '沙发客厅折叠沙发床两用小户型简易出租房布艺沙发卧室懒人沙发 浅灰色',
   '抽屉式收纳柜卧室客厅储物柜衣柜床头柜玩具零食整理柜五斗柜五层',
   '日本品质木门室内门日本F四星环保实木复合门原木风卧室门PL-LAA 秋染橡木色',
   '家用亚克力浴缸小户型成人恒温加热冲浪按摩独立加深泡澡浴池 五件套浴缸 1.5M',
];

var electricalDsc = [
   '滚筒洗衣机出品全自动洗烘一体10公斤大容量节能纤薄空气洗一级能效变频除螨除菌',
   '471升一级能效双变频十字双开四开多门家用超薄电冰箱',
   '华为（HUAWEI）Vision智慧屏 3 75英寸 超薄全面屏4K超高清 240Hz鸿鹄画质 AI摄像头 智能液晶护眼电视机HD75QINA',
   '离子洗空气技术 复合软风 壁挂式空调挂机 一级能效 智能变频',
   '家用电吹风新一代大功率高速吹风机负离子大风力速干不伤发低噪音莱芬便携吹风筒',
   '电饭煲3L五段IH变频加热电饭煲 家用电饭锅2-6人 备长炭加厚铜釜 ',
   '中式家用大吸力抽油烟机顶吸小尺寸脱排油烟机 豪配按键款+油烟分离双层网',
   '工业大功率桶式吸尘器 宾馆酒店吸尘器大功率吸尘机',
];

var toysDsc = [
   '幼儿园感统训练器材儿童跳房子格子圈圈户外运动室内玩具体能 儿童羽毛球',
   '玩偶公仔毛绒玩具女孩儿童陪睡抱枕布娃娃情人节礼物送女友 1m（可拆洗，有内胆）',
   '仿真大熊猫公仔毛绒玩具熊 抱抱熊猫抱枕玩偶布娃娃',
   '拼图3-6岁儿童拼图玩具7-10岁进阶拼图男孩女孩生日礼物',
   '乐高积木男孩子兼容乐高拼装儿童生日礼物玩具建筑',
   '双鹰遥控车路虎授权越野车儿童玩具男女孩汽车模型生日礼物E362',
   '芭比（Barbie）女孩礼物芭比娃娃小公主搭配培养时尚玩具-新梦幻衣橱GBK10',
   '儿童水枪玩具男女孩夏天戏水户外沙滩玩具喷射水枪生日节日礼物'
];

var vegetablesDsc = [
   '陕西红富士苹果10斤孕妇水果新鲜应当季丑萍果整箱嘎啦苹果脆甜 80-85mm 精选9斤装',
   '云南高山威尼斯香蕉 单根独立包装新鲜水果非芭蕉现摘现发 带箱3斤装',
   '红颜牛奶草莓新鲜水果现摘大凉山甜草莓高档礼盒送礼装 丹东草莓3斤大果【20-30g】 现摘现发',
   '骑猴赶马东北巨峰葡萄【顺丰大粒】当季酸甜葡萄巨峰孕妇水果整箱阳光葡萄',
   '泽鲜达四川新鲜毛豆农家现摘新鲜毛豆荚带壳绿豆荚 精选装3斤带壳毛豆',
   '古田珍珠香菇250g 菇香浓郁人工挑选 火锅食材煲汤材料',
   '鲜5斤山东新鲜苦瓜农家自种当季时令蔬菜凉瓜现摘现发批发 清苦脆嫩【绿苦瓜】 5斤装',
   '沙地胡萝卜新鲜蔬菜时令现挖现发萝卜孕妇可吃脆甜水果胡萝卜 3斤带箱'
];

var clothingsDsc = [
   '毛衣男秋冬季针织衫男士厚款保暖毛绒线衣男装 21084灰色',
   '南极人衬衫男 纯色长袖商务衬衫男士棉质舒适衬衣外套修身西装衬衫XL',
   '运动套装男新款青年韩版帅气连帽卫衣套男装潮流时尚休闲两件套男',
   '官方潮牌联名羽绒服男女款冬季保暖加厚派克服中长款工装外套女装',
   '西服套装男士三件套商务职业正装小西装男结婚新郎上班修身外套男 黑色(西服+西裤+衬衫)',
   '秋冬季中老年人男女同款老人加厚加绒马甲季装背心坎肩爸爸妈妈棉马夹外套保暖加绒厚',
   '短裤男夏季薄款男装港风运动休闲潮牌五分裤宽松男士大裤衩裤子',
   '连衣裙女装2023年秋冬新款韩版套装中长款吊带裙法式针织裙子秋装'
];

var goodsDscs = [furnitureDsc, electricalDsc, toysDsc, vegetablesDsc, clothingsDsc];

var furPrice = [123, 124, 1125, 745, 465, 541, 546, 354];
var elePrice = [230, 651, 120, 520, 561, 621, 354, 130];
var toyPrice = [20, 54, 65, 32, 12, 35, 54, 95];
var vegPrice = [151, 95, 350, 210, 230, 36, 69, 100];
var cloPrice = [123, 45, 34, 150, 114, 514, 191, 981];

var goodsPrice = [furPrice, elePrice, toyPrice, vegPrice, cloPrice];


function typeSwich(index) {
    for (let i = 0; i < ctnt_a.length; i++) {
        ctnt_a[i].innerText = objType[index][i];
    }
 }


function imgSwich(indexNav, indexCnt) {
    goodsImg.src = './image/' + indexNav + indexCnt + '.jpg';
 }

function rightSwich(indexNav, indexCnt) {
   descriptionSwich(indexNav, indexCnt);
   priceSwich(indexNav, indexCnt);
}


function descriptionSwich(indexNav, indexCnt) {
   goodsDsc.innerText = goodsDscs[indexNav][indexCnt];
}


function priceSwich(indexNav, indexCnt) {
   goodsPrc.innerText = goodsPrice[indexNav][indexCnt] + '$';
}